<!DOCTYPE html>
<html>
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>Поиск нецензурных слов в тексте</title>
<style>span{background:#FFFFD4;}p{padding:3px;}</style>
</head>

<body>

<?php

/**
* Curse words finder function
*/
function curse_words_finder($str) {

$curse_words = array('апездал', 'апездошенная', 'архипиздрит', 'басран', 'бздение', 'бздеть', 'бздех', 'бзднуть', 'бздун', 'бздунья', 'бздюха', 'бикса', 'блежник', 'блудилище', 'блябу', 'блябуду', 'бляд', 'блядки', 'блядовать', 'блядства', 'блядство', 'блядун', 'блядунья', 'блядь', 'блядюга', 'взъебка', 'взъёбка', 'взъебывать', 'взъёбывать', 'взьебка', 'взьебывать', 'волосянка', 'впиздячить', 'вхуюжить', 'вхуярить', 'вхуячить', 'выблядок', 'выблядыш', 'выебать', 'выебон', 'выебываться', 'выёбываться', 'выеть', 'выпердеть', 'выпиздеться', 'выпиздить', 'высраться', 'выссаться', 'говенка', 'говенный', 'говешка', 'говназия', 'говнецо', 'говно', 'говноед', 'говночист', 'говнюк', 'говнюха', 'говнядина', 'говняк', 'говняный', 'говнять', 'гомосек', 'гондон', 'дермо', 'доебаться', 'долбоеб', 'долбоёб', 'допиздеться', 'допизды', 'дрисня', 'дрист', 'дристануть', 'дристать', 'дристун', 'дристуха', 'дрочена', 'дрочила', 'дрочилка', 'дрочить', 'дрочка', 'дуроеб', 'дуроёб', 'ебал', 'ебало', 'ебальник', 'ебанатик', 'ебанной', 'ебанный', 'ёбанный', 'ебанутый', 'ебануть', 'ебаный', 'ёбаный', 'ебаришка', 'ебарь', 'ёбарь', 'ебаторий', 'ебатория', 'ебать', 'ебатьколотить', 'ебаться', 'ебатьсясраться', 'ебец', 'еби', 'ебистика', 'ебическая', 'еблан', 'ебливая', 'ебливый', 'еблище', 'ебло', 'еблом', 'еблысь', 'ебля', 'ёбля', 'ебнутый', 'ёбнутый', 'ебнуть', 'ёбнуть', 'ебнуться', 'ёбнуться', 'ебня', 'еболызнуть', 'ёболызнуть', 'ебош', 'ебс', 'ёбс', 'ебукентий', 'ебун', 'ебунок', 'елда', 'елдак', 'елдачить', 'жопу', 'заговнять', 'задристать', 'задрока', 'заеб', 'заёб', 'заеба', 'заебал', 'заебанец', 'заебанный', 'заёбанный', 'заебатый', 'заебать', 'заебаться', 'заебись', 'заебываться', 'заеть', 'залупа', 'залупаться', 'залупить', 'залупиться', 'замудохаться', 'запиздеть', 'засерать', 'засерун', 'засеря', 'засирать', 'засранец', 'засрун', 'зассал', 'захуярить', 'захуячить', 'злаебучий', 'злоебучая', 'злоебучий', 'изговнять', 'изговняться', 'испиздить', 'исхуячить', 'кляпыжиться', 'колдоебина', 'коноебиться', 'коноёбиться', 'курва', 'курвенок', 'курвин', 'курвяжник', 'курвяжница', 'курвяжный', 'манда', 'мандавошка', 'мандей', 'мандеть', 'мандища', 'мандовошка', 'мандюк', 'минет', 'минетчик', 'минетчица', 'мозгоеб', 'мозгоёб', 'мокрохвостка', 'мокрощелка', 'мудак', 'муде', 'мудеть', 'мудила', 'мудистый', 'мудня', 'мудоеб', 'мудоёб', 'мудозвон', 'муйня', 'набздеть', 'наговнять', 'надристать', 'надрочить', 'наебал', 'наебаловка', 'наебать', 'наебка', 'наебнуть', 'наебнуться', 'наебывать', 'напиздеть', 'напиздить', 'нассать', 'настоебать', 'насцать', 'нахезать', 'нахуйник', 'нахуяриться', 'нехуй', 'обдристаться', 'обосранец', 'обосрать', 'обосцать', 'обосцаться', 'обсирать', 'однохуйственно', 'опизде', 'опизденеть', 'остопиздеть', 'отебукать', 'отпиздить', 'отпиздячить', 'отпороть', 'отхуевертить', 'отъебаться', 'отъебись', 'отъеть', 'охуевательский', 'охуевать', 'охуевающий', 'охуевший', 'охуенно', 'охуенный', 'охуеть', 'охуительный', 'охуячивать', 'охуячить', 'педрик', 'пердеж', 'пердение', 'пердеть', 'пердильник', 'перднуть', 'пердун', 'пердунец', 'пердунина', 'пердунья', 'пердуха', 'пердь', 'передок', 'перехуярить', 'пернуть', 'пидарас', 'пидор', 'пидрила', 'пизда', 'пизданутый', 'пиздануть', 'пиздатый', 'пизде', 'пиздеж', 'пиздёж', 'пизденка', 'пизденыш', 'пиздёныш', 'пиздеть', 'пиздец', 'пиздить', 'пиздища', 'пиздобол', 'пиздобратия', 'пиздоватый', 'пиздой', 'пиздолет', 'пиздорванец', 'пиздорванка', 'пиздострадатель', 'пиздошить', 'пизду', 'пиздуй', 'пиздун', 'пизды', 'пиздюга', 'пиздюк', 'пиздюлей', 'пиздюли', 'пиздюлина', 'пиздюрить', 'пиздюхать', 'пиздюшник', 'пиздячить', 'писять', 'питишка', 'плеха', 'подговнять', 'подзалупный', 'подъебнуться', 'поебать', 'поебень', 'поебустика', 'поеть', 'попиздеть', 'попиздили', 'попысать', 'посрать', 'поставить', 'похую', 'похуярили', 'поцоватый', 'презерватив', 'приебаться', 'припиздак', 'припиздить', 'прихуярить', 'проблядь', 'проебать', 'проебаться', 'промандеть', 'промудеть', 'пропиздеть', 'пропиздить', 'пропиздячить', 'пысать', 'разврата', 'разебанный', 'разёбанный', 'разъеба', 'разъебай', 'разъебанный', 'разъебать', 'разъебаться', 'распиздай', 'распиздеться', 'распиздон', 'распиздяй', 'распиздяйка', 'распроеть', 'растыка', 'расхуюжить', 'сговнять', 'секель', 'серун', 'серька', 'сика', 'сикать', 'сикель', 'сирать', 'сирывать', 'скурвиться', 'скуреха', 'скурея', 'скуряга', 'скуряжничать', 'слыш', 'спиздить', 'срака', 'сраный', 'сранье', 'срать', 'срун', 'ссака', 'ссаки', 'ссать', 'старпер', 'струк', 'сука', 'суходрочка', 'сучара', 'сучка', 'схуярить', 'сцавинье', 'сцака', 'сцаки', 'сцание', 'сцать', 'сциха', 'сцуль', 'сцыха', 'сыкун', 'тварь', 'терпила', 'титечка', 'титечный', 'титка', 'титочка', 'титька', 'трахать', 'трипер', 'триппер', 'угондошить', 'уебан', 'уебать', 'уебок', 'уебывать', 'уёбывать', 'уеть', 'упиздить', 'усраться', 'усцаться', 'фик', 'фуй', 'хезать', 'хер', 'херня', 'херовина', 'херовый', 'хитровыебанный', 'хитрожопый', 'хлюха', 'худоебина', 'худоёбина', 'хуебратия', 'хуеватенький', 'хуевато', 'хуевертить', 'хуевина', 'хуёвина', 'хуевничать', 'хуёвничать', 'хуево', 'хуёво', 'хуеву', 'хуевый', 'хуёвый', 'хуеглот', 'хуегрыз', 'хуек', 'хуемое', 'хуёмоё', 'хуемырло', 'хуеплет', 'хуеплёт', 'хуепромышленник', 'хуерик', 'хуесос', 'хуета', 'хуетень', 'хуеть', 'хуй', 'хуила', 'хуйло', 'хуйни', 'хуйнуть', 'хуйню', 'хуйня', 'хуйрик', 'хуистика', 'хуйчего', 'хуище', 'хули', 'хуя', 'хуяк', 'хуякать', 'хуякнуть', 'хуями', 'хуячить', 'целка', 'членоплет', 'членосос', 'шлюха', 'шоблаебла', 'шоблаёбла');

$s = preg_replace( "/[^a-zA-ZА-Яа-я0-9\s]/", '', $str );

$match = array();
$low_str = strtolower($s);
array_walk($curse_words, function($val, $key) use (&$match, $low_str) {
    if (($pos = strrpos($low_str, $val)) !== FALSE)  {
        $match[$pos] = $val;
    }
});
if (count($match) > 0) {
	//говно обнаружено
	return true;
} else {
	//говно не обнаружено
	return false;
}

}

//var_dump($curse_words_status);

?>

<h2>Тест 1, содержащий нецензурный текст</h2>
<p>т.к. обнаружен нецензурный контент, ничего не должно вывестись</p>
<p>Вывод: <span><?
$text1 = 'Ваш сайт это убогое говно, вы его сами делали или заплатили криворукому студенту? Я делаю крутые сайты профессионально и дешево!!! Телефон +790000000 или 790000000 по россии. Звоните! Скидка только сейчас! Слыш, мудак, сайт закажи или зассал терпила? твою ебал. Скидка только сейчас, консультация бесплатно. Примеры работ по запросу. Александр';
$curse_words_status_text1 = curse_words_finder($text1);
if ($curse_words_status_text1 === false) {echo $text1;}
?></span></p>

<h2>Тест 2, не содержащий нецензурный текст</h2>
<p>Вывод: <span><?
$text2 = 'Скидка только сейчас, консультация бесплатно. Примеры работ по запросу. Александр';
$curse_words_status_text2 = curse_words_finder($text2);
if ($curse_words_status_text2 === false) {echo $text2;}
?></span></p>

<h2>Тест 3, не содержащий нецензурный текст</h2>
<p>Вывод: <span><?
$text3 = 'В МЭА допустили рост цен на выше 80 долларов за баррель из-за ухода с рынка Венесуэлы и Ирана

Эксперты считают, что рост спроса на нефть в 2018-2019 годах может снизиться на фоне высоких цен на бензин, ослабления валют и торговых спор.

Международное энергетическое агентство (МЭА) опубликовало сентябрьский отчет, в котором допустило рос цен на нефть выше 80 долларов за баррель из-за падения добычи в Венесуэле и Иране.

"Ситуация с добычей нефти в Венесуэле может ухудшаться быстрее, чем ожидалось, конфликты в Ливии могут возобновиться и осталось всего 54 дня до того момента, когда покупатели иранской нефти должны решить, продолжать ли им это делать под угрозой санкций", - говорится в отчете МЭА.

Отмечается, что пока неизвестно, смогут ли другие производители возместить эти объемы. Кроме того, как считают эксперты, добыча в Венесуэле может снизиться с 1,24 млн баррелей в сутки в августе до 1 млн баррелей к концу 2018 года.

Представители МЭА полагают, что нынешние свободные мощности стран ОПЕК составляют 2,7 млн баррелей в сутки, 60% из которых - доля Саудовской Аравии, передает ТАСС.';
$curse_words_status_text3 = curse_words_finder($text3);
if ($curse_words_status_text3 === false) {echo $text3;}
?></span></p>

</body>

</html>
